<details><summary>Show Plan</summary>

```

[command]/home/runner/work/_temp/02ebe9d4-9283-444a-93c4-85b4a943beee/terraform-bin -chdir=terraform show -no-color /tmp/plan.tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.analytics.aws_s3_bucket.analytics-data-lake_bucket must be replaced
-/+ resource "aws_s3_bucket" "analytics-data-lake_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      ~ arn                         = "arn:aws:s3:::walletconnect.cast.staging.analytics.data-lake" -> (known after apply)
      ~ bucket                      = "walletconnect.cast.staging.analytics.data-lake" -> "walletconnect.data_lake.staging" # forces replacement
      ~ bucket_domain_name          = "walletconnect.cast.staging.analytics.data-lake.s3.amazonaws.com" -> (known after apply)
      ~ bucket_regional_domain_name = "walletconnect.cast.staging.analytics.data-lake.s3.eu-central-1.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z21DNDUVLTQW6Q" -> (known after apply)
      ~ id                          = "walletconnect.cast.staging.analytics.data-lake" -> (known after apply)
      ~ object_lock_enabled         = false -> (known after apply)
      + policy                      = (known after apply)
      ~ region                      = "eu-central-1" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
      - tags                        = {} -> null
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
        # (2 unchanged attributes hidden)

      - grant {
          - id          = "2e899ba9939abd99d56104a1a450a63cdadde4979ab3a759e500f860d740ea1e" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = true -> null

              - apply_server_side_encryption_by_default {
                  - kms_master_key_id = "arn:aws:kms:eu-central-1:898587786287:key/bdaee66a-1400-45a1-b99d-caf4b1948742" -> null
                  - sse_algorithm     = "aws:kms" -> null
                }
            }
        }

      - versioning {
          - enabled    = true -> null
          - mfa_delete = false -> null
        }
    }

  # module.analytics.aws_s3_bucket_acl.analytics-data-lake_acl must be replaced
-/+ resource "aws_s3_bucket_acl" "analytics-data-lake_acl" {
      ~ bucket = "walletconnect.cast.staging.analytics.data-lake" # forces replacement -> (known after apply) # forces replacement
      ~ id     = "walletconnect.cast.staging.analytics.data-lake,private" -> (known after apply)
        # (1 unchanged attribute hidden)

      - access_control_policy {
          - grant {
              - permission = "FULL_CONTROL" -> null

              - grantee {
                  - id   = "2e899ba9939abd99d56104a1a450a63cdadde4979ab3a759e500f860d740ea1e" -> null
                  - type = "CanonicalUser" -> null
                }
            }
          - owner {
              - id = "2e899ba9939abd99d56104a1a450a63cdadde4979ab3a759e500f860d740ea1e" -> null
            }
        }
    }

  # module.analytics.aws_s3_bucket_public_access_block.analytics-data-lake_bucket must be replaced
-/+ resource "aws_s3_bucket_public_access_block" "analytics-data-lake_bucket" {
      ~ bucket                  = "walletconnect.cast.staging.analytics.data-lake" # forces replacement -> (known after apply) # forces replacement
      ~ id                      = "walletconnect.cast.staging.analytics.data-lake" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.analytics.aws_s3_bucket_server_side_encryption_configuration.analytics-data-lake_bucket must be replaced
-/+ resource "aws_s3_bucket_server_side_encryption_configuration" "analytics-data-lake_bucket" {
      ~ bucket = "walletconnect.cast.staging.analytics.data-lake" # forces replacement -> (known after apply) # forces replacement
      ~ id     = "walletconnect.cast.staging.analytics.data-lake" -> (known after apply)

        # (1 unchanged block hidden)
    }

  # module.analytics.aws_s3_bucket_versioning.analytics-data-lake_bucket must be replaced
-/+ resource "aws_s3_bucket_versioning" "analytics-data-lake_bucket" {
      ~ bucket = "walletconnect.cast.staging.analytics.data-lake" # forces replacement -> (known after apply) # forces replacement
      ~ id     = "walletconnect.cast.staging.analytics.data-lake" -> (known after apply)

      ~ versioning_configuration {
          + mfa_delete = (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # module.ecs.aws_ecs_service.app_service will be updated in-place
  ~ resource "aws_ecs_service" "app_service" {
        id                                 = "arn:aws:ecs:eu-central-1:898587786287:service/staging-cast/staging-cast-service"
        name                               = "staging-cast-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging-cast:91" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs.aws_ecs_task_definition.app_task_definition must be replaced
-/+ resource "aws_ecs_task_definition" "app_task_definition" {
      ~ arn                      = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging-cast:91" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "staging-cast" -> (known after apply)
      ~ revision                 = 91 -> (known after apply)
      - tags                     = {} -> null
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ecs.aws_iam_policy.analytics-data-lake_bucket_access must be replaced
-/+ resource "aws_iam_policy" "analytics-data-lake_bucket_access" {
      ~ arn         = "arn:aws:iam::898587786287:policy/staging-cast_analytics-data-lake_bucket_access" -> (known after apply)
      ~ description = "Allows staging-cast to read/write from walletconnect.cast.staging.analytics.data-lake" -> "Allows staging-cast to read/write from walletconnect.data_lake.staging" # forces replacement
      ~ id          = "arn:aws:iam::898587786287:policy/staging-cast_analytics-data-lake_bucket_access" -> (known after apply)
        name        = "staging-cast_analytics-data-lake_bucket_access"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Resource = [
                          - "arn:aws:s3:::walletconnect.cast.staging.analytics.data-lake",
                          + "arn:aws:s3:::walletconnect.data_lake.staging",
                        ]
                        # (3 unchanged attributes hidden)
                    },
                  ~ {
                      ~ Resource = [
                          - "arn:aws:s3:::walletconnect.cast.staging.analytics.data-lake/*",
                          + "arn:aws:s3:::walletconnect.data_lake.staging/*",
                        ]
                        # (3 unchanged attributes hidden)
                    },
                    {
                        Action   = [
                            "kms:GenerateDataKey",
                        ]
                        Effect   = "Allow"
                        Resource = [
                            "arn:aws:kms:eu-central-1:898587786287:key/bdaee66a-1400-45a1-b99d-caf4b1948742",
                        ]
                        Sid      = "AllGenerateDataKeyForAnalyticsBucket"
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
      ~ policy_id   = "ANPA5COABPQXSTCNXAT26" -> (known after apply)
      - tags        = {} -> null
        # (2 unchanged attributes hidden)
    }

  # module.ecs.aws_iam_role_policy_attachment.analytics-data-lake-bucket-policy-attach must be replaced
-/+ resource "aws_iam_role_policy_attachment" "analytics-data-lake-bucket-policy-attach" {
      ~ id         = "staging-cast-ecs-task-execution-role-20230403071327851400000002" -> (known after apply)
      ~ policy_arn = "arn:aws:iam::898587786287:policy/staging-cast_analytics-data-lake_bucket_access" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

Plan: 8 to add, 1 to change, 8 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  ~ update in-place%0A-/+ destroy and then create replacement%0A%0ATerraform will perform the following actions:%0A%0A  # module.analytics.aws_s3_bucket.analytics-data-lake_bucket must be replaced%0A-/+ resource "aws_s3_bucket" "analytics-data-lake_bucket" {%0A      + acceleration_status         = (known after apply)%0A      + acl                         = (known after apply)%0A      ~ arn                         = "arn:aws:s3:::walletconnect.cast.staging.analytics.data-lake" -> (known after apply)%0A      ~ bucket                      = "walletconnect.cast.staging.analytics.data-lake" -> "walletconnect.data_lake.staging" # forces replacement%0A      ~ bucket_domain_name          = "walletconnect.cast.staging.analytics.data-lake.s3.amazonaws.com" -> (known after apply)%0A      ~ bucket_regional_domain_name = "walletconnect.cast.staging.analytics.data-lake.s3.eu-central-1.amazonaws.com" -> (known after apply)%0A      ~ hosted_zone_id              = "Z21DNDUVLTQW6Q" -> (known after apply)%0A      ~ id                          = "walletconnect.cast.staging.analytics.data-lake" -> (known after apply)%0A      ~ object_lock_enabled         = false -> (known after apply)%0A      + policy                      = (known after apply)%0A      ~ region                      = "eu-central-1" -> (known after apply)%0A      ~ request_payer               = "BucketOwner" -> (known after apply)%0A      - tags                        = {} -> null%0A      + website_domain              = (known after apply)%0A      + website_endpoint            = (known after apply)%0A        # (2 unchanged attributes hidden)%0A%0A      - grant {%0A          - id          = "2e899ba9939abd99d56104a1a450a63cdadde4979ab3a759e500f860d740ea1e" -> null%0A          - permissions = [%0A              - "FULL_CONTROL",%0A            ] -> null%0A          - type        = "CanonicalUser" -> null%0A        }%0A%0A      - server_side_encryption_configuration {%0A          - rule {%0A              - bucket_key_enabled = true -> null%0A%0A              - apply_server_side_encryption_by_default {%0A                  - kms_master_key_id = "arn:aws:kms:eu-central-1:898587786287:key/bdaee66a-1400-45a1-b99d-caf4b1948742" -> null%0A                  - sse_algorithm     = "aws:kms" -> null%0A                }%0A            }%0A        }%0A%0A      - versioning {%0A          - enabled    = true -> null%0A          - mfa_delete = false -> null%0A        }%0A    }%0A%0A  # module.analytics.aws_s3_bucket_acl.analytics-data-lake_acl must be replaced%0A-/+ resource "aws_s3_bucket_acl" "analytics-data-lake_acl" {%0A      ~ bucket = "walletconnect.cast.staging.analytics.data-lake" # forces replacement -> (known after apply) # forces replacement%0A      ~ id     = "walletconnect.cast.staging.analytics.data-lake,private" -> (known after apply)%0A        # (1 unchanged attribute hidden)%0A%0A      - access_control_policy {%0A          - grant {%0A              - permission = "FULL_CONTROL" -> null%0A%0A              - grantee {%0A                  - id   = "2e899ba9939abd99d56104a1a450a63cdadde4979ab3a759e500f860d740ea1e" -> null%0A                  - type = "CanonicalUser" -> null%0A                }%0A            }%0A          - owner {%0A              - id = "2e899ba9939abd99d56104a1a450a63cdadde4979ab3a759e500f860d740ea1e" -> null%0A            }%0A        }%0A    }%0A%0A  # module.analytics.aws_s3_bucket_public_access_block.analytics-data-lake_bucket must be replaced%0A-/+ resource "aws_s3_bucket_public_access_block" "analytics-data-lake_bucket" {%0A      ~ bucket                  = "walletconnect.cast.staging.analytics.data-lake" # forces replacement -> (known after apply) # forces replacement%0A      ~ id                      = "walletconnect.cast.staging.analytics.data-lake" -> (known after apply)%0A        # (4 unchanged attributes hidden)%0A    }%0A%0A  # module.analytics.aws_s3_bucket_server_side_encryption_configuration.analytics-data-lake_bucket must be replaced%0A-/+ resource "aws_s3_bucket_server_side_encryption_configuration" "analytics-data-lake_bucket" {%0A      ~ bucket = "walletconnect.cast.staging.analytics.data-lake" # forces replacement -> (known after apply) # forces replacement%0A      ~ id     = "walletconnect.cast.staging.analytics.data-lake" -> (known after apply)%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A  # module.analytics.aws_s3_bucket_versioning.analytics-data-lake_bucket must be replaced%0A-/+ resource "aws_s3_bucket_versioning" "analytics-data-lake_bucket" {%0A      ~ bucket = "walletconnect.cast.staging.analytics.data-lake" # forces replacement -> (known after apply) # forces replacement%0A      ~ id     = "walletconnect.cast.staging.analytics.data-lake" -> (known after apply)%0A%0A      ~ versioning_configuration {%0A          + mfa_delete = (known after apply)%0A            # (1 unchanged attribute hidden)%0A        }%0A    }%0A%0A  # module.ecs.aws_ecs_service.app_service will be updated in-place%0A  ~ resource "aws_ecs_service" "app_service" {%0A        id                                 = "arn:aws:ecs:eu-central-1:898587786287:service/staging-cast/staging-cast-service"%0A        name                               = "staging-cast-service"%0A        tags                               = {}%0A      ~ task_definition                    = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging-cast:91" -> (known after apply)%0A        # (15 unchanged attributes hidden)%0A%0A        # (4 unchanged blocks hidden)%0A    }%0A%0A  # module.ecs.aws_ecs_task_definition.app_task_definition must be replaced%0A-/+ resource "aws_ecs_task_definition" "app_task_definition" {%0A      ~ arn                      = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging-cast:91" -> (known after apply)%0A      ~ container_definitions    = (sensitive value) # forces replacement%0A      ~ id                       = "staging-cast" -> (known after apply)%0A      ~ revision                 = 91 -> (known after apply)%0A      - tags                     = {} -> null%0A        # (9 unchanged attributes hidden)%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A  # module.ecs.aws_iam_policy.analytics-data-lake_bucket_access must be replaced%0A-/+ resource "aws_iam_policy" "analytics-data-lake_bucket_access" {%0A      ~ arn         = "arn:aws:iam::898587786287:policy/staging-cast_analytics-data-lake_bucket_access" -> (known after apply)%0A      ~ description = "Allows staging-cast to read/write from walletconnect.cast.staging.analytics.data-lake" -> "Allows staging-cast to read/write from walletconnect.data_lake.staging" # forces replacement%0A      ~ id          = "arn:aws:iam::898587786287:policy/staging-cast_analytics-data-lake_bucket_access" -> (known after apply)%0A        name        = "staging-cast_analytics-data-lake_bucket_access"%0A      ~ policy      = jsonencode(%0A          ~ {%0A              ~ Statement = [%0A                  ~ {%0A                      ~ Resource = [%0A                          - "arn:aws:s3:::walletconnect.cast.staging.analytics.data-lake",%0A                          + "arn:aws:s3:::walletconnect.data_lake.staging",%0A                        ]%0A                        # (3 unchanged attributes hidden)%0A                    },%0A                  ~ {%0A                      ~ Resource = [%0A                          - "arn:aws:s3:::walletconnect.cast.staging.analytics.data-lake/*",%0A                          + "arn:aws:s3:::walletconnect.data_lake.staging/*",%0A                        ]%0A                        # (3 unchanged attributes hidden)%0A                    },%0A                    {%0A                        Action   = [%0A                            "kms:GenerateDataKey",%0A                        ]%0A                        Effect   = "Allow"%0A                        Resource = [%0A                            "arn:aws:kms:eu-central-1:898587786287:key/bdaee66a-1400-45a1-b99d-caf4b1948742",%0A                        ]%0A                        Sid      = "AllGenerateDataKeyForAnalyticsBucket"%0A                    },%0A                ]%0A                # (1 unchanged attribute hidden)%0A            }%0A        )%0A      ~ policy_id   = "ANPA5COABPQXSTCNXAT26" -> (known after apply)%0A      - tags        = {} -> null%0A        # (2 unchanged attributes hidden)%0A    }%0A%0A  # module.ecs.aws_iam_role_policy_attachment.analytics-data-lake-bucket-policy-attach must be replaced%0A-/+ resource "aws_iam_role_policy_attachment" "analytics-data-lake-bucket-policy-attach" {%0A      ~ id         = "staging-cast-ecs-task-execution-role-20230403071327851400000002" -> (known after apply)%0A      ~ policy_arn = "arn:aws:iam::898587786287:policy/staging-cast_analytics-data-lake_bucket_access" # forces replacement -> (known after apply) # forces replacement%0A        # (1 unchanged attribute hidden)%0A    }%0A%0APlan: 8 to add, 1 to change, 8 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0

```

</details>

*Action: `pull_request`*